# Homebrew bundle for dotfiles
# Install with: brew bundle --file=./Brewfile

# Brews (CLI tools)
brew "fzf"
brew "zoxide"
brew "eza"
brew "fd"
brew "bat"          # Modern cat replacement
brew "ripgrep"      # Modern grep replacement
brew "gnupg"        # GPG (GNU Privacy Guard)
brew "uutils-coreutils" # Rust coreutils for cross-platform compatibility
brew "tealdeer"     # Fast tldr client
brew "neovim"
brew "nano"         # GNU nano editor
brew "starship"
brew "z"
brew "kubectl"      # Kubernetes CLI
brew "kubectl-cnpg" # CloudNativePG plugin for kubectl
brew "k9s"          # Kubernetes TUI
brew "kind"         # Kubernetes in Docker
brew "pinentry-mac" # macOS pinentry for GPG
brew "navi"         # Interactive cheatsheets (fzf-powered)
brew "jq"           # JSON query and transformation
brew "gh"           # GitHub CLI
brew "helm"         # Kubernetes package manager
brew "node"         # JavaScript runtime

# Optional brews - uncomment if needed
# brew "kafka"
brew "awscli"       # AWS command line
brew "azure-cli"    # Azure command line
# brew "postgresql@15" # PostgreSQL database (if needed)
# brew "yq"          # YAML query tool
# brew "wget"        # URL download tool

# Casks (Applications)
cask "google-chrome"
cask "bitwarden"
cask "docker-desktop"
cask "openvpn-connect"
cask "zoom"
cask "dbeaver-community"
cask "drawio"
cask "visual-studio-code"
cask "postman"
cask "kitty"

# Fonts
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"

# Optional casks - uncomment if needed
# cask "omnissa-horizon-client"
cask "shottr"       # Screenshot tool
cask "github"
