# Homebrew bundle for dotfiles
# Install with: brew bundle --file=./Brewfile

# Brews (CLI tools)
brew "fzf"
brew "zoxide"
brew "eza"
brew "fd"
brew "bat"          # Modern cat replacement
brew "ripgrep"      # Modern grep replacement
brew "neovim"
brew "nano"         # GNU nano editor
brew "starship"
brew "z"
brew "kubectl"      # Kubernetes CLI
brew "kubectl-cnpg" # CloudNativePG plugin for kubectl
brew "k9s"          # Kubernetes TUI
brew "kind"         # Kubernetes in Docker

# Optional brews - uncomment if needed
# brew "kafka"

# Casks (Applications)
cask "google-chrome"
cask "microsoft-remote-desktop"
cask "bitwarden"
cask "docker-desktop"
cask "openvpn-connect"
cask "zoom"
cask "dbeaver-community"
cask "drawio"
cask "visual-studio-code"
cask "postman"
cask "kitty"

# Fonts
cask "font-fira-code-nerd-font"

# Optional casks - uncomment if needed
# cask "omnissa-horizon-client"
# cask "github"
